In [237]:
import pandas as pd
import numpy as np

In [238]:
data = {
    "Name":['saee' , 'kishori' , 'Charlie' , 'David' , 'Shravani'] ,
    "Age" : [21 , 20 , 25 , 26 , 23],
    "Department":['HR' , 'IT' , 'Finance' , np.nan , 'HR'],
    "Salary":[10000000000 , 5000000 , 300000 , 100000 , 450000]
}

In [239]:
df = pd.DataFrame(data)
df

       Name  Age Department       Salary
0      saee   21         HR  10000000000
1   kishori   20         IT      5000000
2   Charlie   25    Finance       300000
3     David   26        NaN       100000
4  Shravani   23         HR       450000

In [240]:
df[df['Salary']> 1000000]

      Name  Age Department       Salary
0     saee   21         HR  10000000000
1  kishori   20         IT      5000000

In [241]:
df[df['Department'] == 'HR']

       Name  Age Department       Salary
0      saee   21         HR  10000000000
4  Shravani   23         HR       450000

In [242]:
df.iloc[0]      # First row
df.iloc[0:3]   # First 3 rows

      Name  Age Department       Salary
0     saee   21         HR  10000000000
1  kishori   20         IT      5000000
2  Charlie   25    Finance       300000

In [243]:
df.loc[(df['Department'] == 'IT') & (df['Salary'] > 300000), ['Name', 'Salary']]

      Name   Salary
1  kishori  5000000

In [244]:
df['Status'] = df['Age'].apply(lambda x: "Minor" if x < 21 else "Adult")

In [245]:
df

       Name  Age Department       Salary Status
0      saee   21         HR  10000000000  Adult
1   kishori   20         IT      5000000  Minor
2   Charlie   25    Finance       300000  Adult
3     David   26        NaN       100000  Adult
4  Shravani   23         HR       450000  Adult

In [246]:
print(df.columns)

Index(['Name', 'Age', 'Department', 'Salary', 'Status'], dtype='object')

In [247]:
df['Department'].unique()

array(['HR', 'IT', 'Finance', nan], dtype=object)

In [248]:
df['Department'].value_counts()

Department
HR         2
IT         1
Finance    1
Name: count, dtype: int64

In [249]:
df['Promoted Salary'] = df['Salary']* 10 #Broadcasting rule

In [250]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26        NaN       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [251]:
df.isnull()

    Name    Age  Department  Salary  Status  Promoted Salary
0  False  False       False   False   False            False
1  False  False       False   False   False            False
2  False  False       False   False   False            False
3  False  False        True   False   False            False
4  False  False       False   False   False            False

In [252]:
df.isnull().sum()

Name               0
Age                0
Department         1
Salary             0
Status             0
Promoted Salary    0
dtype: int64

`df.dropna()` - Any row that had null value is removed due to removing the null values

In [253]:
df.dropna()  #Creates a dataFrame for view only , original dataFrame is unchanged

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
4  Shravani   23         HR       450000  Adult          4500000

In [254]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26        NaN       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [255]:
df.dropna(how = 'any') # any row that has any null value is dropped

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
4  Shravani   23         HR       450000  Adult          4500000

In [256]:
df.dropna(how = 'all') # row is dropped only if all the values are null

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26        NaN       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [257]:
df.fillna(0)

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26          0       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [258]:
df['Age'].fillna(df['Age'] , inplace  = True)

In [259]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26        NaN       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [260]:
df['Department'].fillna(df['Department'].mode()[0], inplace=True)
df

C:\Users\ASUS\AppData\Local\Temp\ipykernel_20516\3602087347.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Department'].fillna(df['Department'].mode()[0], inplace=True)

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26         HR       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

## Forward Fill — ffill
Meaning:

“Copy the last valid value above and use it to fill the missing one below.”

In [261]:
dataa = {
    'Day': [1, 2, 3, 4, 5],
    'Temperature': [30, np.nan, np.nan, 33, np.nan]
}

df1 = pd.DataFrame(dataa)

In [262]:
df1

   Day  Temperature
0    1         30.0
1    2          NaN
2    3          NaN
3    4         33.0
4    5          NaN

In [263]:
df1['Temperature'] = df1['Temperature'].ffill()

In [264]:
df1

   Day  Temperature
0    1         30.0
1    2         30.0
2    3         30.0
3    4         33.0
4    5         33.0

In [265]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26         HR       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

## Backward Fill — bfill
Meaning:

“Copy the next valid value below and use it to fill the missing one above.”

In [266]:
df1['Temperature'] = df1['Temperature'].bfill()
df1

   Day  Temperature
0    1         30.0
1    2         30.0
2    3         30.0
3    4         33.0
4    5         33.0

In [267]:
df1['Day'].replace(5 , 6)

0    1
1    2
2    3
3    4
4    6
Name: Day, dtype: int64

In [268]:
df1

   Day  Temperature
0    1         30.0
1    2         30.0
2    3         30.0
3    4         33.0
4    5         33.0

# Cleaning of Data

In [269]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26         HR       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          4500000

In [270]:
df['Promoted Salary'] = df['Promoted Salary'].replace([4500000, 3000000], [3000000, 3000000])

In [271]:
df

       Name  Age Department       Salary Status  Promoted Salary
0      saee   21         HR  10000000000  Adult     100000000000
1   kishori   20         IT      5000000  Minor         50000000
2   Charlie   25    Finance       300000  Adult          3000000
3     David   26         HR       100000  Adult          1000000
4  Shravani   23         HR       450000  Adult          3000000

In [ ]:
df_dup = df[df.duplicated(keep = 'last')] # declare first element as duplicated  , vice a versa for first
df_dup

Empty DataFrame
Columns: [Name, Age, Department, Salary, Status, Promoted Salary]
Index: []